Tekla Open API Reference for Tekla Structures 2025
Assertion Properties
The Assertion type exposes the following members.
Properties
Name | Description
DetailedMessage
 Gets the detailed message provided by the assertion.
Message
 Gets the message provided by the assertion.
MethodName
 Gets the name of the method the assertion failed in.
Top
See Also
Reference
Assertion Class
Tekla.Structures Namespace